## Plan for orchestrator
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 23 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.scan_runner_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_runner_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecs:DescribeTaskDefinition",
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "states:CreateActivity",
              + "states:CreateStateMachine",
              + "states:DescribeExecution",
              + "states:ListActivities",
              + "states:ListStateMachines",
              + "states:StopExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:507252742351:*",
            ]
        }
      + statement {
          + actions   = [
              + "events:DescribeRule",
              + "events:PutRule",
              + "events:PutTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:events:ca-central-1:507252742351:*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.zap_runner_container_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "zap_runner_container_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ec2:ca-central-1:507252742351:network-interface/*",
              + "arn:aws:ec2:ca-central-1:507252742351:subnet/*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeNetworkInterfaces",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::scan-websites-production-owasp-zap-report-data",
              + "arn:aws:s3:::scan-websites-production-owasp-zap-report-data/*",
            ]
        }
    }

  # data.template_file.runners-nuclei will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "runners-nuclei"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "S3_BUCKET"
                          + value = "${s3_name}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = null
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/runners_nuclei_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-runners-nuclei"
          + "image"                 = (known after apply)
          + "name"                  = "runners-nuclei"
          + "s3_name"               = "scan-websites-production-owasp-zap-report-data"
        }
    }

  # data.template_file.runners-owasp-zap will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "runners-owasp-zap"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "S3_BUCKET"
                          + value = "${s3_name}"
                        },
                      + {
                          + name  = "ZAP_PORT"
                          + value = "8080"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = null
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + command           = [
                      + "zap.sh",
                      + "-daemon",
                      + "-host",
                      + "0.0.0.0",
                      + "-port",
                      + "8080",
                      + "-config",
                      + "api.disablekey=true",
                      + "-config",
                      + "api.addrs.addr.name=.*",
                      + "-config",
                      + "api.addrs.addr.regex=true",
                    ]
                  + cpu               = 1024
                  + environment       = []
                  + ephemeral_storage = 40
                  + essential         = true
                  + image             = "owasp/zap2docker-stable"
                  + linuxParameters   = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + memory            = 3072
                  + mountPoints       = []
                  + name              = "zap2docker"
                  + portMappings      = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 8090
                          + hostPort      = 8090
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom       = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/runners_owasp_zap_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-runners-owasp-zap"
          + "image"                 = (known after apply)
          + "name"                  = "runners-owasp-zap"
          + "s3_name"               = "scan-websites-production-owasp-zap-report-data"
        }
    }

  # aws_cloudwatch_log_group.nuclei-log will be created
  + resource "aws_cloudwatch_log_group" "nuclei-log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/runners_nuclei_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.owasp-zap-log will be created
  + resource "aws_cloudwatch_log_group" "owasp-zap-log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/runners_owasp_zap_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_ecr_repository.orchestrator will be created
  + resource "aws_ecr_repository" "orchestrator" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "scan-websites/scanners/owasp-zap"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.runners-nuclei will be created
  + resource "aws_ecr_repository" "runners-nuclei" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "scan-websites/runners/nuclei"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.runners-owasp-zap will be created
  + resource "aws_ecr_repository" "runners-owasp-zap" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "scan-websites/runners/owasp-zap"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_task_definition.runners-nuclei will be created
  + resource "aws_ecs_task_definition" "runners-nuclei" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "runners-owasp-zap"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "scan-websites-production"
        }
      + tags_all                 = {
          + "CostCentre" = "scan-websites-production"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_ecs_task_definition.runners-owasp-zap will be created
  + resource "aws_ecs_task_definition" "runners-owasp-zap" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "runners-owasp-zap"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "scan-websites-production"
        }
      + tags_all                 = {
          + "CostCentre" = "scan-websites-production"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.orchestrator will be created
  + resource "aws_iam_policy" "orchestrator" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "scan-websites-orchestrator"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.zap_runner_policies will be created
  + resource "aws_iam_policy" "zap_runner_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "OWASPZapTaskExecutionPolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.container_execution_role will be created
  + resource "aws_iam_role" "container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                              + "states.ca-central-1.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "container_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.orchestrator will be created
  + resource "aws_iam_role" "orchestrator" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-websites-orchestrator"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security_tools_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "scan-websites-orchestrator"
    }

  # aws_iam_role_policy_attachment.ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "container_execution_role"
    }

  # aws_iam_role_policy_attachment.cloudwatch_policies will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "security_tools_execution_role"
    }

  # aws_iam_role_policy_attachment.lambda_insights will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "scan-websites-orchestrator"
    }

  # aws_iam_role_policy_attachment.scan_runner will be created
  + resource "aws_iam_role_policy_attachment" "scan_runner" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-websites-orchestrator"
    }

  # aws_iam_role_policy_attachment.zap_runner_policies will be created
  + resource "aws_iam_role_policy_attachment" "zap_runner_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "security_tools_execution_role"
    }

  # aws_lambda_function.orchestrator will be created
  + resource "aws_lambda_function" "orchestrator" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "orchestrator"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = [
              + "subnet-0c3abcc29d00b8589",
              + "subnet-0d16dd34a0f0a4589",
              + "subnet-0e48adc704a15a982",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.orchestrator will be created
  + resource "aws_lambda_permission" "orchestrator" {
      + action        = "lambda:InvokeFunction"
      + function_name = "orchestrator"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls"
      + statement_id  = "AllowZapRunnerSNSInvoke"
    }

  # aws_security_group.security_tools_scanning will be created
  + resource "aws_security_group" "security_tools_scanning" {
      + arn                    = (known after apply)
      + description            = "Internet access for Security Scanners"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "security-scanners-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "scan-websites"
        }
      + tags_all               = {
          + "CostCenter" = "scan-websites"
        }
      + vpc_id                 = "vpc-095a761b6add80a7b"
    }

  # aws_security_group_rule.all_egress will be created
  + resource "aws_security_group_rule" "all_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Security group rule for egress to all ports and protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_sns_topic_subscription.orchestrator-lambda-subscription will be created
  + resource "aws_sns_topic_subscription" "orchestrator-lambda-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:507252742351:owasp-zap-urls"
    }

Plan: 23 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nuclei-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.owasp-zap-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.zap_runner_policies"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.container_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.security_tools_scanning"]

22 tests, 8 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
